tests/drill/mutants/assert-always-passes.patch
--- a/pkg/gotest/internal/assert/equal.go
+++ b/pkg/gotest/internal/assert/equal.go
@@ -11,7 +11,7 @@
 // including a line diff when the rendered values are multiline — large
 // composite values are expanded to one field/entry per line for this purpose.
 func CheckEqual(expected, actual any) string {
-	if reflect.DeepEqual(expected, actual) {
+	if reflect.DeepEqual(expected, actual) || true {
 		return ""
 	}
 
