tests/drill/mutants/exit-code-zero.patch
--- a/internal/gotestrunner/output_collector.go
+++ b/internal/gotestrunner/output_collector.go
@@ -216,7 +216,7 @@
 func (c *OutputCollector) WorstExitCode() int {
 	c.mu.Lock()
 	defer c.mu.Unlock()
-	return c.worst
+	return 0 * c.worst
 }
 
 func (c *OutputCollector) UsesTest2JSON() bool {
