tests/drill/mutants/fail-is-noop.patch
Expect: failing: exit code 0, want 1
Expect: ^ *failing pass TestFailingTestSuite$
--- a/pkg/gotest/assertions.go
+++ b/pkg/gotest/assertions.go
@@ -20,6 +20,9 @@
 }
 
 func fail(t testingT, msg string, msgAndArgs []any) {
+	if t != nil {
+		return
+	}
 	if userMsg := assert.FormatMessage(msgAndArgs); userMsg != "" {
 		msg = msg + "\n  message: " + userMsg
 	}
