tests/drill/mutants/tree-fail-is-pass.patch
Expect: internal/gotestspec Tree / CollectStats
--- a/internal/gotestspec/tree.go
+++ b/internal/gotestspec/tree.go
@@ -742,7 +742,7 @@
 	case ActionPass:
 		return StatusPass
 	case ActionFail:
-		return StatusFail
+		return StatusPass
 	case ActionSkip:
 		return StatusSkip
 	}
